Config/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОСубсидии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтправителемТрансферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленнаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыДоговоровКонтрагентов/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ИспользоватьУчетКредитовИЗаймов = ПолучитьФункциональнуюОпцию("ИспользоватьУчетКредитовИЗаймов");
	ВестиУчетПоРеализацииТоваровУслугКомитентов = ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугКомитентов");
	ВестиУчетПоРеализацииТоваровУслугЧерезКомиссионеров = ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугЧерезКомиссионеров");
	ВестиУчетПоЗакупкеТоваровУслугЧерезКомиссионеров = ПолучитьФункциональнуюОпцию("ВестиУчетПоЗакупкеТоваровУслугЧерезКомиссионеров");
	ВестиУчетПоЗакупкеТоваровУслугДляКомитентов = ПолучитьФункциональнуюОпцию("ВестиУчетПоЗакупкеТоваровУслугДляКомитентов");
	
	ДанныеВыбора = Новый СписокЗначений;
	Для к = 0 По Перечисления.ВидыДоговоровКонтрагентов.Количество() - 1 Цикл
		Значение = Перечисления.ВидыДоговоровКонтрагентов.Получить(к);
		Если НЕ ИспользоватьУчетКредитовИЗаймов И (Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ПредоставленныйКредит")
			ИЛИ Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ПолученныйКредит")
			ИЛИ Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ПредоставленнаяГарантия")
			ИЛИ Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг")) Тогда
		ИначеЕсли НЕ ВестиУчетПоРеализацииТоваровУслугКомитентов И Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентом") Тогда
		ИначеЕсли НЕ ВестиУчетПоРеализацииТоваровУслугЧерезКомиссионеров И Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионером") Тогда
		ИначеЕсли НЕ ВестиУчетПоЗакупкеТоваровУслугЧерезКомиссионеров И Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку") Тогда
		ИначеЕсли НЕ ВестиУчетПоЗакупкеТоваровУслугДляКомитентов И Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку") Тогда
		Иначе
			ДанныеВыбора.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
